basicCase/0.orig/U
/*--------------------------------*- C++ -*------------------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        mapMethod       nearest;
        outOfBounds     clamp;
        fileName        "$FOAM_CASE/constant/boundaryData"; // Directory containing data
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }

    "(bottom|top)"
    {
        type            noSlip;
    }

    "(left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //



