basicCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1207552;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1213952;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12800;
        startFace       1220352;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          12800;
        startFace       1233152;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    inlet
    {
        type            patch;
        nFaces          2048;
        startFace       1245952;
    }
    outlet
    {
        type            patch;
        nFaces          2048;
        startFace       1248000;
    }
)

// ************************************************************************* //
