basicCase/system/decomposeParDict.template

// * * * * C++* * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method scotch;
numberOfSubdomains |-numberOfProcessors-|;
scotchCoeffs
{
}
